# Афинный шифр, Python-воплощение
# Шифр подстановочный. Криптографическое преобразование заменяет символы открытого текста на другие по правилу.
from pprint import pprint


arabian_digits: list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32]
rus_alphabet: list = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']

# TODO: del
# digits_eng: list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]
eng_alphabet: list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'i', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

digits_rus_dict: dict = dict(zip(rus_alphabet, arabian_digits))
digits_eng_dict: dict = dict(zip(eng_alphabet, arabian_digits))

print(digits_rus_dict)
print(digits_eng_dict)

# TODO добавить input() введите слово для зашифровки Афинным шифром. Сейчас просто слово.
word_encrypt: str = 'вфеврале'

# прописываем соответствие "буква алфавита - номер"
print('Перевод элементов слова для шифрования в арабские цифры.')
for alphb in word_encrypt:
    print(digits_rus_dict[alphb])

# Задаём ключ. Это пара чисел alpha и beta, которые принадлежат кольцу класса вычетов пункта "зашифрованне" 7:00
