# Хранилище переменных
from time import sleep

# Шифр простой замены
true_alphabet: list = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с',
                       'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']

crypto_alphabet: list = ['б', 'а', 'г', 'в', 'е', 'д', 'ж', 'ё', 'и', 'з', 'к', 'й', 'м', 'л', 'о', 'н', 'р', 'п', 'т',
                         'с', 'ф', 'у', 'ц', 'х', 'ш', 'ч', 'ъ', 'щ', 'ь', 'ы', 'я', 'э', 'ю']

# для проверки корректного ввода, английский алфавит и спецсимволы
eng_alphabet_spec: list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'i',
                           's', 't', 'u', 'v', 'w', 'x', 'y', 'z', ' ', '!', '@', '#', '$', '%', '^', '&', '*', '(',
                           ')', '_', '+', '-', '"', '№', ';', ':', '?', '<', '>', ',' '.', '/', '\\', '|', '', '~',
                           '»', '{', '}', '[', ']', '=', '', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A',
                           'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S',
                           'T', 'U', 'V', 'W', 'X', 'Y', 'Z']


# ф-ия выхода
def simple_exit():
    print('\nВведены предосудительные символы!\nПожалуйста, запустите программу заново и выполните корректный ввод!')
    sleep(2)
    exit()


def checkin_input_word(symbols: str) -> bool:
    """Проверка введённых %username% данных"""
    print('\nПроверочная фаза, пожалуйста, подождите...')
    sleep(1)
    if len(symbols) == 0:
        simple_exit()

    for key in symbols:
        print(f'Тщательно проверяем символ: {key}')
        if (len(key) == 0) or (key in eng_alphabet_spec):
            simple_exit()
    print('Проверка пройдена успешно!')
    return True


# Афинный шифр
arabian_digits: list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32]


def rae(alpha: int, mod_n: int) -> int:
    """Расширенный алгоритм Евклида (на основе файла 4_rae.py), возвращаем обратные элемент. Всегда положительный."""
    a = a_final = mod_n
    b = alpha

    # default
    x2: int = 1
    x1: int = 0
    y2: int = 0
    y1: int = 1

    def qrxy(a: int, b: int) -> tuple:
        q: int = a // b
        r: int = a % b
        x: int = x2 - q * x1
        y: int = y2 - q * y1
        return q, r, x, y

    # run
    q, r, x, y = qrxy(a, b)

    count: int = 1
    while b != 0:
        q, r, x, y = qrxy(a, b)

        if r == 0:
            d = b
            x = x1
            y = y1
            break

        a: int = b
        b: int = r
        x2: int = x1
        x1: int = x
        y2: int = y1
        y1: int = y
        count += 1

    if y < 0:
        y = y % a_final
    elif y > 0:
        pass
    else:
        print('Иной результат')

    return y


# Афинный рекуррентный шифр
